/**
 * 常用正则表达式
 */
import type { Pattern } from '../types/pattern'

const $pattern: Pattern = {
  // 金额：可以为0，第一位不能为0，小数位不超过2位
  sum: /^(0|[1-9][0-9]*)(\.\d{1,2}|)$/,
  // 折扣：0-10之间的数字，不等于临界值，小数位不超过2位
  discount: /^((0\.[1-9]{1})|(([1-9]{1})(\.\d{1,2})?))$/,
  // 件数 / 次数 / 天数 / 积分：可以为0，第一个数字不能为0，整数
  num: /^(0|[1-9][0-9]*)$/,
  // 件数 / 次数 / 天数 / 积分：不可以为0，第一个数字不能为0，整数
  numNoZero: /^([1-9][0-9]*)$/,
  // 库存：可以为0、-9999，第一个数字不能为0，整数
  stock: /^(-9999|0|[1-9][0-9]*)$/,
  // 小时：00-24，不等于24
  hour: /((1|0)[0-9]|2[0-3])/,
  // 分钟：00-60，不等于60
  minute: /([0-5][0-9])/,
  // 邮编
  postCode: /^[0-9]{6}$/,
  // 邮箱
  email: /^\w+([-+.]\w+)*@\w+([-.]\\w+)*\.\w+([-.]\w+)*$/,
  // 手机号验证
  phone: /^1[0-9]\d{9}$/,
  // 座机号验证 021-1234567(8)
  landline: /^((0\d{2,3})-)(\d{7,8})(-(\d{3,}))?$/,
  // 电话号码验证，包含手机号和座机号
  telephone: /^([1]\d{10}|([(（]?0[0-9]{2,3}[）)]?[-]?)?([2-9][0-9]{6,7})+(-[0-9]{1,4})?)$/,
  // 不能输入中文汉字
  nohanzi: /^[^\u4e00-\u9fa5]{0,}$/,
  // 输入数字用英文逗号分离
  numbydot: /^(\d+,)*\d+$/,
  // 输入纯数字或者纯英文或者数字英文字母组合用英文逗号分离
  numEnbydot: /^([0-9a-zA-Z]+,)*[0-9a-zA-Z]+$/,
  // 身份证号
  idCard: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
  // 银行卡号
  bankCard: /^\d{16,19}$/,
  // 不能有空格
  noSpace: /^[^ ]+$/,
  // 至少包含两种6-20个英文字母、数字或字符（除空格）
  password: /^(?![d]+$)(?![a-zA-Z]+$)(?![^da-zA-Z]+$).{6,20}$/,
}

export default $pattern
